In [2]:
import pandas as pd
dictionary={"name":["ali","veli","zübeyde","ahmet","kubra","can"],
           "age":[12,34,56,78,None,12],
           "note":[123,456,78,87654,None,89]}
dataframe1=pd.DataFrame(dictionary)
print(dataframe1)

      name   age     note
0      ali  12.0    123.0
1     veli  34.0    456.0
2  zübeyde  56.0     78.0
3    ahmet  78.0  87654.0
4    kubra   NaN      NaN
5      can  12.0     89.0

In [3]:
df=pd.read_csv("maaslar.csv")

In [4]:
print(df)

              unvan  Egitim Seviyesi   maas
0             Cayci                1   2250
1          Sekreter                2   2500
2  Uzman Yardimcisi                3   3000
3             Uzman                4   4000
4  Proje Yoneticisi                5   5500
5               Sef                6   7500
6             Mudur                7  10000
7          Direktor                8  15000
8           C-level                9  25000
9               CEO               10  50000

In [5]:
print(dataframe1.head())

      name   age     note
0      ali  12.0    123.0
1     veli  34.0    456.0
2  zübeyde  56.0     78.0
3    ahmet  78.0  87654.0
4    kubra   NaN      NaN

In [6]:
print(dataframe1.columns)

Index(['name', 'age', 'note'], dtype='object')

In [7]:
print(dataframe1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     5 non-null      float64
 2   note    5 non-null      float64
dtypes: float64(2), object(1)
memory usage: 272.0+ bytes
None

In [8]:
print(dataframe1.dtypes)

name     object
age     float64
note    float64
dtype: object

In [9]:
print(dataframe1.describe())

             age         note
count   5.000000      5.00000
mean   38.400000  17680.00000
std    28.684491  39116.96814
min    12.000000     78.00000
25%    12.000000     89.00000
50%    34.000000    123.00000
75%    56.000000    456.00000
max    78.000000  87654.00000

In [10]:
print(dataframe1.loc[:,"age"])

0    12.0
1    34.0
2    56.0
3    78.0
4     NaN
5    12.0
Name: age, dtype: float64

In [11]:
dataframe1["yeni_age"]=[1,2,3,4,5,6]
print(dataframe1.loc[:3,"age"])

0    12.0
1    34.0
2    56.0
3    78.0
Name: age, dtype: float64

In [12]:
filtre1=dataframe1.age>10
dataframe1["bool"]=filtre1
print(dataframe1.loc[:,["age","bool"]])

    age   bool
0  12.0   True
1  34.0   True
2  56.0   True
3  78.0   True
4   NaN  False
5  12.0   True

In [13]:
dataframe1.dropna(inplace=True)
dataframe1

      name   age     note  yeni_age  bool
0      ali  12.0    123.0         1  True
1     veli  34.0    456.0         2  True
2  zübeyde  56.0     78.0         3  True
3    ahmet  78.0  87654.0         4  True
5      can  12.0     89.0         6  True

In [14]:
dataframe1.columns=[each.upper() for each in dataframe1.columns]
dataframe1.columns

Index(['NAME', 'AGE', 'NOTE', 'YENI_AGE', 'BOOL'], dtype='object')

In [15]:
data1=dataframe1.head()
data2=dataframe1.tail()
data_concat=pd.concat([data1,data2],axis=0)
data_concat

      NAME   AGE     NOTE  YENI_AGE  BOOL
0      ali  12.0    123.0         1  True
1     veli  34.0    456.0         2  True
2  zübeyde  56.0     78.0         3  True
3    ahmet  78.0  87654.0         4  True
5      can  12.0     89.0         6  True
0      ali  12.0    123.0         1  True
1     veli  34.0    456.0         2  True
2  zübeyde  56.0     78.0         3  True
3    ahmet  78.0  87654.0         4  True
5      can  12.0     89.0         6  True